package com.himedia.practice;

public class homeWork {
    public static void main(String[] args) {
        /*Java는 JVM(자바 가상 머신, Java Virtual Machine)을 사용하여 운영체제와 독립적으로 동작할 수 있는 언어로, 어느 운영체제에서나 같은 형태로 실행될 수 있는 객체 지향 언어입니다.

                특징

        1. 객체지향언어
        객체지향 언어의 특징인 캡슐화, 상속성, 다형성을 완벽하게 지원합니다.
        여기서 말하는 캡슐화, 상속성, 다형성은 객체지향개념에 대해 다룰 때 자세히 설명하도록 하겠습니다.
                우선적으로 자바는 이런 특징들이 있다 정도만 알아두어도 좋습니다.
                객체를 만들기 위한 설계도인 클래스를 작성하고, 객체와 객체 즉 클래스와 클래스를 연결해서 목적에 맞게 프로그램을 만드는 것이 Java 언어가 가지는 큰 특징입니다.
        2. 모든 운영체제에서 실행 가능
        자바는 JVM을 사용하기 때문에 위에서 말했듯 자바 실행환경이 설치되어 있는 모든 운영체제에서 실행 가능합니다.
        다양한 애플리케이션 개발: 자바는 윈도우, 리눅스, 유닉스 등 다양한 운영체제에서 실행되는 프로그램을 개발 할 수 있습니다. 단순한 콘솔 프로그램부터 클라이언트용 윈도우 애플리케이션, 서버용 웹 애플리케이션 그리고 모바일용 안드로이드 앱에 이르기까지 거의 모든 곳에서 실행되는 프로그램을 개발 할 수 있습니다.
        3. 하이브리드 언어
        컴파일 언어인 동시에 인터프리터 언어로 작성한 코드를 컴파일하여 이진 파일(class)을 만든 다음 자바 런타임이 이진 파일을 인터프리트 하면서 실행합니다.
        자바는 컴파일 언어에 가까운 속도와 시스템 독립성을 얻을 수 있다.
        4. 메모리를 자동으로 관리:
        C++은 메모리에 생성된 객체를 제거하기 위해 개발자가 직접 코드를 작성해야합니다.
        만약 이 작업을 잘 처리하지 않으면 프로그램은 불완전해지고 갑자기 다운되는 현상을 겪게 됩니다. 자바는 개발자가 직접 메모리에 접근할 수 없도록 설계되었으며 메모리는 자바가 직접 관리하게 됩니다.
                객체 생성 시 자동적으로 메모리영역을 찾아서 할당하고, 사용이 완료되면 쓰레기 수집기(Garbage Collector) 를 실행시켜 자동적으로 사용하지 않는 객체를 제거시켜줍니다.
                따라서 개발자는 메모리 관리의 수고를 덜고, 핵심기능 코드 작성에 집중할 수 있습니다.
        5. 오픈소스 라이브러리의 풍부함
        자바는 오픈소스 언어이고 자바 프로그램에서 사용하는 라이브러리 또한 오픈소스의 양이 방대하여, 고급기능을 구현하는 코드를 작성하는 대신 검증된 오픈소스 라이브러리를 사용할 수 있다는 장점이 있습니다.
        6. 멀티 쓰레드 지원
        멀티 쓰레드 기능은 다른 언어에서는 운영체제에 따라 구현방법도 처리방식도 다르지만 자바에서 개발되는 멀티쓰레드 프로그램은 시스템과는 관계없이 구현 가능하며, 관련된 라이브러리가 제공되므로 구현이 쉽습니다.
        그리고 여러 쓰레드에 대한 스케쥴링을 자바의 인터프리터가 담당하게 되어 멀티 쓰레드 기능을 다른 언어에 비해 비교적 쉽게 사용할 수 있습니다.
: 하나의 프로그램이 동시에 여러 작업을 처리해야 하는 경우와, 대용량 작업을 빨리 처리하기 위해 서브 작업으로 분리해서 병렬처리하려면 멀티쓰레드 프로그래밍이 필요합니다.
                자바는 쓰레드 생성 및 제어와 관련된 라이브러리 API를 제공하고있기 때문에 실행되는 운영체제에 관계없이 멀티 쓰레드를 쉽게 구현 가능합니다.
        7. 네트워크와 분산처리 지원
        인터넷과 대규모 분산환경을 염두에 두어 다양한 네트워크 프로그래밍 라이브러리를 통해 비교적 짧은 시간에 네트워크 관련 프로그램을 쉽게 개발할 수 있도록 지원합니다.
        8. 동적 로딩 지원
        자바로 작성된 프로그램은 여러 클래스로 구성되어 있는데, 실행 시에 모든 클래스가 로딩되는 것이 아닌, 프로그램 실행 중 필요한 시점에 클래스를 로딩하여 사용할 수 있다는 장점이 있습니다.
    */



        /*
        *
        *
        * */
    }
}
